tap 'homebrew/cask-versions'
brew 'mas'

brew 'dos2unix'
brew 'jq'
brew 'stow'

# Communications
cask 'muzzle'
cask 'slack'
mas 'Textual 7', id: 1262957439
# cask 'zoomus'

# Shells, CLI, process management
brew 'asdf'
brew 'bat'
brew 'dash'
brew 'findutils'
brew 'gnu-sed'
cask 'iTerm2'
brew 'pidof'
brew 'pv'
brew 'zsh'

# Text Search
brew 'ctags'
brew 'fzf'
brew 'ripgrep'

# Github and SCM
cask 'fork'
brew 'gist'
brew 'git'
cask 'github'
brew 'hub'

# AWS and Infrastructure
cask 'aws-vault'
brew 'awscli'
cask 'docker'
tap 'heroku/brew'
brew 'heroku/brew/heroku'
brew 'iamy'
brew 'packer'

# Web Development
cask 'chromedriver'
brew 'elm'
brew 'libxml2'
brew 'nginx', restart_service: true

# Networking
brew 'curl'
brew 'dnsmasq', restart_service: true
brew 'nmap'
brew 'wget'

# Backup, Archiving and Compression
cask 'dropbox'
# cask 'google-drive-file-stream'
brew 'gnu-tar'
brew 'unrar'

# Web Browsers
cask 'brave-browser'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'vivaldi'

# Go Ecosystem
brew 'go'

# Haskell Ecosystem
brew 'cabal-install'
brew 'ghc'
brew 'haskell-stack'

# Java Ecosystem
cask 'java'
brew 'maven'

# Python Ecosystem
brew 'python'

# Rust Ecosystem
brew 'rustup-init'

# Documentation and Diagramming
brew 'graphviz'
brew 'imagemagick'
brew 'ispell'
brew 'pandoc'
brew 'plantuml'
brew 'svgcleaner'

# Security and Encryption tools
mas '1Password 7', id: 1333542190
brew 'gpg2'
cask 'keybase'

# Databases
cask 'datagrip'
brew 'mysql@5.6', link: true
brew 'postgresql'
brew 'redis'
brew 'sqlite'

# Editors
brew 'neovim'
tap 'railwaycat/emacsmacport'
cask 'railwaycat/emacsmacport/emacs-mac'
brew 'vim'
cask 'visual-studio-code'

# Drivers
tap 'homebrew/cask-drivers'
cask 'logitech-control-center'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-inconsolata'
cask 'font-source-code-pro'

# Continuous Integration
tap 'buildkite/cli'
brew 'bk'

# Productivity and Niceties
cask 'alfred'
cask 'dash'
cask 'karabiner-elements' # I like to map the caps lock key to escape
cask 'shortcat'
mas 'Things 3', id: 904280696
mas "Monosnap", id: 540348655
