tap 'homebrew/cask-versions'
brew 'mas'

brew 'dos2unix'
brew 'jq'
brew 'stow'

# Communications
cask 'slack'

# Shells, CLI, process management
brew 'asdf'
brew 'bat'
brew 'bottom'
brew 'dash'
brew 'direnv'
brew 'fd'
brew 'findutils'
brew 'gdu'
cask 'ghostty'
brew 'gnu-sed'
brew 'gum'
brew 'pidof'
brew 'pv'
brew 'shellcheck'
brew 'starship'

# Text Search
brew 'ctags'
brew 'fzf'
brew 'ripgrep'

# Source code management
tap 'github/gh'
brew 'github/gh/gh'
brew 'codeberg-cli'
cask 'fork'
brew 'gist'
brew 'git'
brew 'git-delta'
brew 'git-filter-repo'
brew 'lazygit'

# AWS and Infrastructure
brew 'aws-vault'
brew 'awscli'
brew 'dive'
cask 'docker-desktop'
brew 'packer'

# Web Development
brew 'caddy'
brew 'libxml2'

# Networking
brew 'curl'
brew 'dnsmasq', restart_service: true
brew 'nmap'

# Backup, Archiving and Compression
# cask 'google-drive-file-stream'
brew 'gnu-tar'

# Web Browsers
cask 'brave-browser'
cask 'google-chrome'

# Programming language support
brew 'tree-sitter'
brew 'tree-sitter-cli'

# Haskell Ecosystem
brew 'cabal-install'
brew 'ghc'
brew 'ghcup'
brew 'haskell-stack'

# Java Ecosystem
brew 'openjdk'
brew 'maven'

# Python Ecosystem
brew 'python'

# Lua Ecosystem
brew 'lua'
brew 'luarocks'

# Odin Ecosystem
brew 'odin'

# Pony Ecosystem
brew 'ponyc'
brew 'corral'

# OCaml Ecosystem
brew 'ocaml'

# Rust Ecosystem
brew 'rustup'

# Go Ecosystem
brew 'go'
brew 'golangci-lint'
brew 'govulncheck'

# Agentic AI tools
cask 'claude-code'
cask 'codex'
brew 'gemini-cli'

# Documentation and Diagramming
brew 'adr-tools'
brew 'graphviz'
brew 'imagemagick'
cask 'imageoptim'
brew 'ispell'
brew 'pandoc'
brew 'plantuml'

# Security and Encryption tools
cask '1password'
brew 'gpg2'
brew 'openssl'

# Databases
brew 'mysql-client@8.0'
brew 'postgresql'
brew 'redis'
brew 'sqlite'

# Editors
brew 'neovim'
cask 'zed'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-cascadia-code'
cask 'font-fira-code'
cask 'font-inconsolata'
cask 'font-meslo-lg-nerd-font'

# Continuous Integration
brew 'buildkite/buildkite/buildkite-cli'

# Productivity and Niceties
cask 'alfred'
cask 'dash'
mas 'Things 3', id: 904280696
cask 'thingsmacsandboxhelper'
mas 'MeetingBar', id: 1532419400

cask 'spotify'
