tap 'homebrew/cask-versions'
brew 'mas'

brew 'dos2unix'
brew 'jq'
brew 'stow'

# Communications
# cask 'amazon-chime'
# cask 'slack'
# mas 'Textual 7', id: 1262957439

# Shells, CLI, process management
brew 'asdf'
brew 'bat'
brew 'dash'
brew 'direnv'
brew 'fd'
brew 'findutils'
brew 'gnu-sed'
cask 'iTerm2'
brew 'pidof'
brew 'pv'
brew 'shellcheck'

# Text Search
brew 'ctags'
brew 'fzf'
brew 'ripgrep'

# Github and SCM
tap 'github/gh'
brew 'github/gh/gh'
cask 'fork'
brew 'gist'
brew 'git'
brew 'git-delta'
brew 'git-filter-repo'

# AWS and Infrastructure
cask 'aws-vault'
brew 'awscli'
brew 'dive'
cask 'docker'
tap 'heroku/brew'
brew 'heroku/brew/heroku'
brew 'iamy'
brew 'packer'

# Web Development
brew 'caddy'
cask 'chromedriver'
brew 'libxml2'

# Networking
brew 'curl'
brew 'dnsmasq', restart_service: true
brew 'nmap'
brew 'wget'

# Backup, Archiving and Compression
# cask 'google-drive-file-stream'
brew 'gnu-tar'

# Web Browsers
cask 'brave-browser'
# cask 'firefox-developer-edition'
# cask 'google-chrome'
# cask 'vivaldi'

# Haskell Ecosystem
brew 'cabal-install'
brew 'ghc'
brew 'haskell-stack'

# Java Ecosystem
brew 'openjdk'
brew 'maven'

# Python Ecosystem
brew 'python'

# Lua
brew 'lua'
brew 'luarocks'

# Documentation and Diagramming
brew 'adr-tools'
brew 'graphviz'
brew 'imagemagick'
cask 'imageoptim'
brew 'ispell'
brew 'pandoc'
brew 'plantuml'
brew 'svgcleaner'

# Security and Encryption tools
cask '1password'
brew 'gpg2'
brew 'openssl'

# Databases
brew 'mysql-client@5.7'
brew 'postgresql'
brew 'redis'
brew 'sqlite'

# Editors
brew 'neovim'
cask 'jetbrains-toolbox'
cask 'visual-studio-code'
cask 'zed'

vscode 'dbaeumer.vscode-eslint'
vscode 'eamodio.gitlens'
vscode 'github.copilot'
vscode 'github.copilot-chat'
vscode 'github.github-vscode-theme'
vscode 'github.vscode-github-actions'
vscode 'github.vscode-pull-request-github'
vscode 'golang.go'
vscode 'hashicorp.hcl'
vscode 'hashicorp.terraform'
vscode 'ms-vsliveshare.vsliveshare'
vscode 'pkief.material-icon-theme'
vscode 'redhat.vscode-yaml'
vscode 'rust-lang.rust-analyzer'
vscode 'shopify.ruby-extensions-pack'
vscode 'shopify.ruby-lsp'
vscode 'vscodevim.vim'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-cascadia-code'
cask 'font-fira-code'
cask 'font-inconsolata'
cask 'font-meslo-lg-nerd-font'

# Continuous Integration
tap 'buildkite/cli'
brew 'bk'

# Productivity and Niceties
cask 'alfred'
cask 'dash'
# cask 'shortcat'
mas 'Things 3', id: 904280696
