# tap 'railwaycat/emacsmacport'
# cask "railwaycat/emacsmacport/emacs-mac"

# tap 'sj26/git-buildkite'
# brew 'sj26/git-buildkite/git-buildkite'

brew 'awscli'
brew 'chromedriver'
brew 'ctags'
brew 'curl'
brew 'dash'
brew 'dos2unix'
brew 'gist'
brew 'git'
brew 'gnu-tar'
brew 'go'
brew 'graphviz'
brew 'hub'
brew 'iamy'
brew 'ispell'
brew 'lesspipe'
brew 'libxml2'
brew 'maven'
brew 'nmap'
brew 'nodenv'
brew 'packer'
brew 'pidof'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'zsh'

cask 'alfred'
cask 'aws-vault'
cask "cyberduck"
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'gpgtools'
cask 'keybase'
cask 'imageoptim'
cask 'iTerm2'
cask 'java'
cask 'screenhero'
cask 'sequel-pro'
cask 'shortcat'
cask 'slack'
cask 'sourcetree'
cask 'visual-studio-code'
