tap 'homebrew/cask-versions'

brew 'dos2unix'

cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'imageoptim'

# Communications
cask 'muzzle'
cask 'slack'
cask 'zoomus'

# Shells, CLI, process management
brew 'dash'
cask 'iTerm2'
brew 'pidof'
brew 'pv'
brew 'zsh'

# Text Search
brew 'ctags'
brew 'fzf'
brew 'lesspipe'
brew 'ripgrep'

# Github and SCM
cask 'fork'
brew 'gist'
brew 'git'
brew 'hub'
cask 'sourcetree'

# AWS and Infrastructure
cask 'aws-vault'
brew 'awscli'
brew 'iamy'
brew 'packer'

# Web Development
brew 'chromedriver'
brew 'elm'
brew 'libxml2'
brew 'nginx'
brew 'nodenv'

# Networking
brew 'curl'
brew 'dnsmasq'
brew 'nmap'
brew 'wget'

# Archiving and Compression
brew 'gnu-tar'
brew 'unrar'

# Web Browsers
cask 'firefoxdeveloperedition'
cask 'google-chrome'
cask 'vivaldi'

# Go Ecosystem
brew 'go'

# Haskell Ecosystem
brew 'cabal-install'
brew 'ghc'
brew 'haskell-stack'

# Ruby Ecosystem
brew 'rbenv'

# Java Ecosystem
cask 'java'
brew 'maven'

# Python Ecosystem
brew 'python'

# Documentation and Diagramming
brew 'graphviz'
brew 'ispell'
brew 'pandoc'
brew 'plantuml'

# Encryption tools
brew 'gpg2'
cask 'keybase'

# Databases
cask 'datagrip'
brew 'mysql@5.6', link: true
brew 'postgresql'
brew 'redis'
brew 'sqlite'

# Editors
tap 'railwaycat/emacsmacport'
cask 'railwaycat/emacsmacport/emacs-mac'
brew 'vim'
cask 'visual-studio-code'

# Drivers
tap 'homebrew/cask-drivers'
cask 'logitech-control-center'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-inconsolata'
cask 'font-source-code-pro'

# Continuous Integration
tap 'sj26/git-buildkite'
brew 'sj26/git-buildkite/git-buildkite'

# Keyboard Interface
cask 'alfred'
cask 'dash'
cask 'karabiner-elements' # I like to map the caps lock key to escape
cask 'shortcat'
