tap 'caskroom/versions'

# tap 'railwaycat/emacsmacport'
# cask "railwaycat/emacsmacport/emacs-mac"

# tap 'sj26/git-buildkite'
# brew 'sj26/git-buildkite/git-buildkite'

brew 'awscli'
brew 'chromedriver'
brew 'ctags'
brew 'curl'
brew 'dash'
brew 'dnsmasq'
brew 'dos2unix'
brew 'gist'
brew 'git'
brew 'gnu-tar'
brew 'graphviz'
brew 'hub'
brew 'iamy'
brew 'ispell'
brew 'lesspipe'
brew 'libxml2'
brew 'nginx'
brew 'nmap'
brew 'nodenv'
brew 'packer'
brew 'pidof'
brew 'pv'
brew 'python'
brew 'python3'
brew 'sqlite'
brew 'the_platinum_searcher'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'zsh'

cask 'alfred'
cask 'aws-vault'
cask 'cyberduck'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'grammarly'
cask 'imageoptim'
cask 'iTerm2'
cask 'karabiner-elements'
cask 'shortcat'
cask 'slack'
cask 'sourcetree'
cask 'visual-studio-code'

# Web Browsers
cask 'firefoxdeveloperedition'
cask 'google-chrome'

# Go Ecosystem
brew 'go'
brew 'dep'

# Ruby Ecosystem
brew 'rbenv'

# Java Ecosystem
cask 'java8'
brew 'maven'

# Encryption tools
brew 'gpg2'
cask 'keybase'

cask 'datagrip'

tap 'caskroom/drivers'
cask 'logitech-control-center'
